mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf16xl/mb9bf16xl.svd
        <!-- REGISTER "ADCMP_ACSD3" -->
        <register derivedFrom="ADCMP_ACSD0">
          <name>ADCMP_ACSD3</name>
          <description>ADCMP ch.3 Control Register D [BHW]</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1E1</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACSC4" -->
        <register derivedFrom="ADCMP_ACSC0">
          <name>ADCMP_ACSC4</name>
          <description>ADCMP ch.4 Control Register C [BHW]</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1E4</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACSD4" -->
        <register derivedFrom="ADCMP_ACSD0">
          <name>ADCMP_ACSD4</name>
          <description>ADCMP ch.4 Control Register D [BHW]</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1E5</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACSC5" -->
        <register derivedFrom="ADCMP_ACSC0">
          <name>ADCMP_ACSC5</name>
          <description>ADCMP ch.5 Control Register C [BHW]</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1E8</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACSD5" -->
        <register derivedFrom="ADCMP_ACSD0">
          <name>ADCMP_ACSD5</name>
          <description>ADCMP ch.5 Control Register D [BHW]</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1E9</addressOffset>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "MFT1" -->
    <peripheral derivedFrom="MFT0">
      <name>MFT1</name>
      <baseAddress>0x40021000</baseAddress>
      <description>Multifunction Timer 1</description>
      <version>A</version>
      <!-- INTERRUPT "MFT1_WFG_DTIF" -->
      <interrupt>
        <name>MFT1_WFG_DTIF</name>
        <value>22</value>
      </interrupt>
      <!-- INTERRUPT "MFT1_FRT_PEAK" -->
      <interrupt>
        <name>MFT1_FRT_PEAK</name>
        <value>28</value>
      </interrupt>
      <!-- INTERRUPT "MFT1_FRT_ZERO" -->
      <interrupt>
        <name>MFT1_FRT_ZERO</name>
        <value>29</value>
      </interrupt>
      <!-- INTERRUPT "MFT1_ICU" -->
      <interrupt>
        <name>MFT1_ICU</name>
        <value>30</value>
      </interrupt>
      <!-- INTERRUPT "MFT1_OCU" -->
      <interrupt>
        <name>MFT1_OCU</name>
        <value>31</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFT_PPG" -->
    <peripheral>
      <name>MFT_PPG</name>
      <description>PPG Configuration</description>
      <version>A</version>
      <groupName>MFT_PPG</groupName>
      <baseAddress>0x40024000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x1</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x9</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x11</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x21</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x29</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2C</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x31</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x34</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x41</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x49</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4C</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x51</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x54</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x100</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x104</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x140</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x144</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x200</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x204</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x208</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x210</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x214</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x218</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x240</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x244</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x248</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x250</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x254</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x258</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x280</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x284</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x288</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x290</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x294</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x298</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2C0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2C4</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2C8</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2CC</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2D0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2D4</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2D8</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x300</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x304</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x308</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x310</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x314</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x318</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x340</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x344</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x348</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x34C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x350</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x354</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x358</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "PPG00_02_04" -->
      <interrupt>
        <name>PPG00_02_04</name>
        <value>36</value>
      </interrupt>
      <!-- INTERRUPT "PPG08_10_12" -->
      <interrupt>
        <name>PPG08_10_12</name>
        <value>37</value>
      </interrupt>
      <!-- INTERRUPT "PPG16_18_20" -->
      <interrupt>
        <name>PPG16_18_20</name>
        <value>38</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "TTCR0" -->
        <register>
          <name>TTCR0</name>
          <description>PPG Start Trigger Control Register 0 [BHW]</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xF0</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TRG6O" -->
            <field>
              <name>TRG6O</name>
              <description>PPG6 trigger stop bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TRG4O" -->
            <field>
              <name>TRG4O</name>
              <description>PPG4 trigger stop bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TRG2O" -->
            <field>
              <name>TRG2O</name>
              <description>PPG2 trigger stop bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TRG0O" -->
            <field>
              <name>TRG0O</name>
              <description>PPG0 trigger stop bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "CS0" -->
            <field>
              <name>CS0</name>
              <description>8-bit UP counter clock select bits for comparison</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MONI0" -->
            <field>
              <name>MONI0</name>
              <description>8-bit UP counter operation state monitor bit for comparison</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "STR0" -->
            <field>
              <name>STR0</name>
              <description>8-bit UP counter operation enable bit for comparison</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
